package br.com.vinicios.util;

public final class BoardTemplate{
    private BoardTemplate() {};

    public final static String BOARD_TEMPLATE =
"    0   1  2   3   4   5   6   7  8\n" +
"  ┌──────────┬──────────┬──────────┐\n" +
"0 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"1 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"2 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"  ├──────────┼──────────┼──────────┤\n" +
"3 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"4 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"5 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"  ├──────────┼──────────┼──────────┤\n" +
"6 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"7 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"8 │ %2s %2s %2s │ %2s %2s %2s │ %2s %2s %2s │\n" +
"  └──────────┴──────────┴──────────┘";
}